using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Sketch
{
    class Game
    {
        bool _gameIsPlaying;
        bool _keepPlaying;
        Player playerInfo;
        Screen screenInfo;

        public bool GameIsPlaying
        {
            get { return _gameIsPlaying; }
            set { _gameIsPlaying = value; }
        }

        public bool KeepPlaying
        {
            get { return _keepPlaying; }
            set { _keepPlaying = value; }
        }

        public Game()
        {
            KeepPlaying = true;
            GameIsPlaying = false;
        }

        public void PSInfo(Player player, Screen screen)
        {
            playerInfo = player;
            screenInfo = screen;
        }

        public void GameTitle()
        {
            while (true)
            {
                Console.WindowHeight = 35;
                Console.WindowWidth = 120;
                Console.WriteLine("----------------------------------------------------------------------------------------------------------------------");
                Console.WriteLine("----------------------------------------------------------------------------------------------------------------------");
                Console.WriteLine(".______        ______        ___       _______   _______  __    _______  __    __  .___________. _______ .______      \r\n|   _  \\      /  __  \\      /   \\     |       \\ |   ____||  |  /  _____||  |  |  | |           ||   ____||   _  \\     \r\n|  |_)  |    |  |  |  |    /  ^  \\    |  .--.  ||  |__   |  | |  |  __  |  |__|  | `---|  |----`|  |__   |  |_)  |    \r\n|      /     |  |  |  |   /  /_\\  \\   |  |  |  ||   __|  |  | |  | |_ | |   __   |     |  |     |   __|  |      /     \r\n|  |\\  \\----.|  `--'  |  /  _____  \\  |  '--'  ||  |     |  | |  |__| | |  |  |  |     |  |     |  |____ |  |\\  \\----.\r\n| _| `._____| \\______/  /__/     \\__\\ |_______/ |__|     |__|  \\______| |__|  |__|     |__|     |_______|| _| `._____|\r\n                                                                                                                      \r\n");
                Console.WriteLine("----------------------------------------------------------------------------------------------------------------------");
                Console.WriteLine("----------------------------------------------------------------------------------------------------------------------");
                Console.WriteLine("\n\t\t\t\t\t  콘솔 게임 로드파이터에 오신것을 환영합니다\n");
                Console.WriteLine("\t\t\t\t\t-------------------------------------------\n");
                Console.WriteLine("\t\t\t\t\t  역동적으로 움직이는 길을 따라 운전하세요\n");
                Console.WriteLine("\t\t\t\t\t  길을 벗어나 벽에 부딪히면 게임 오버입니다\n");
                Console.WriteLine("\t\t\t\t\t-------------------------------------------");
                Console.WriteLine("\t\t\t\t\t\t\t[조작 설명]\n");
                Console.WriteLine("\t\t\t\t\t    [방향키 ← or 키 A] : 왼쪽 이동\n");
                Console.WriteLine("\t\t\t\t\t    [방향키 → or 키 D] : 오른쪽 이동\n");
                Console.WriteLine("\t\t\t\t\t    [방향키 ↓ or 키 S] : 중립 (고정)\n");
                Console.WriteLine("\t\t\t\t\t-------------------------------------------");
                Console.WriteLine("\t\t\t\t\t   시작을 원하시면 Enter를 입력해주세요\n");
                Console.WriteLine("\t\t\t\t\t    종료을 원하시면 ESC를 입력해주세요");

                var inputKey = Console.ReadKey(true);

                if(inputKey.Key == ConsoleKey.Enter)
                {
                    Console.Clear();
                    GameIsPlaying = true;
                    break;
                }
                else if (inputKey.Key == ConsoleKey.Escape)
                {
                    Console.Clear();
                    Console.WriteLine("게임이 종료됩니다");
                    KeepPlaying = false;
                    break;
                }
            }            
        }

        public void GameOver()
        {
            GameIsPlaying = false;
            Console.Clear();
            Console.WindowHeight = 40;
            Console.WindowWidth = 80;
            Console.ForegroundColor = ConsoleColor.White;
            Console.BackgroundColor = ConsoleColor.Black;
            Console.WriteLine("!!!!!!!!!!!!!!!!!!!!!!!!< GAME OVER >!!!!!!!!!!!!!!!!!!!!!!!!!");
            Console.WriteLine("-------------------------------------------------------------");
            Console.WriteLine($"\t\t\t[획득 점수] : {screenInfo.Score}");
            Console.WriteLine("-------------------------------------------------------------");
            Console.WriteLine("\t타이틀로 돌아가시려면 Enter 키를 입력해주세요");
            Console.WriteLine("-------------------------------------------------------------");
            Console.WriteLine("\t    종료를 원하시면 ESC 키를 입력해주세요");
            Console.WriteLine("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@+@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\r\n@@@+..@@@@@@@@@@@@@@@:.....#@...+@@@@@@@@@@@@@@@@@@@@@@@@@@@\r\n@@@@......%@...@@%......@@@@@#...@@@@@@@@@@@@..@@@@@@@@@@@@@\r\n@......+@@@@@-..@@-:@@..@@@......@@@@......@..%@@@@@@@@@@@@@\r\n@..@@@@-:@@@:...@@@@@.......@@@..%@@..........@@@@@@@@@@@@@@\r\n@@@@.............@@@@...@@+..@@@@@.@....@@:-@@@@.......@@@@@\r\n@@@..@@@@@..@@@...@@@..@@@@@..%@@=..@@@@@@@@@*..@@@@@@@.@@@@\r\n@@@...@@@=..+@@@..@@@@@@@@@@.........@@@@@@@..@@@-...=@@.@@@\r\n@@@@.......@@@@@@@.:.%@@@@@@@..@@@@:..@@@@..@@@--+###=*@..@@\r\n@@@@@@@@@@@@....+@@@%+.....@@@........@@@.#@@#@@@%####-@@.@@\r\n@@@@@@@@@@@..@@@@@#+#@@@@.....@@@@@@@@@@.@@@#+..#@@%##+=@.*@\r\n@@@@@@@@@@@.@@..=+**#%@..+*.*@@..=.......@@%:.+=..@@%##.@:.@\r\n@@@@@@@@@@@..@@@@@@@@@..=*##..@@%@@@@@+.+@@..*++=..-##%-@@.@\r\n@@@@@@@@@@@@*........:@%.:=-..-@@@%%%@@@@...@@%+:@@#=+@@@@.@\r\n@@@@@@@@@@@@#..%@%#@@@@@@..=...=@%%%%%@@@.+:...:@@@@@@.....@\r\n@@@@@@@@@@@@@@..=%+.=@@...@#+@@@@%%%%%@..@........=@@.-#@#.=\r\n@@@@@@@@@@@@@@@@..-+...@@...@@%%%%%%%%@@.@@@@@@@@@...=#%=.@@\r\n@@@@@@@@@@@@@@..@......@.@@.@@@@@%%%%%@@.#@@@@@%@@@...:-.%@@\r\n@@@@@@@@@@@@@%.@@@@@@@==@@@.@@%@@@%%@%@@...@@@@@%@@@#.....@@\r\n@@@@@@@@@@@@@.+@@@@@@#.=.........@@@@@@.@@@-.#@@@@@@@@@@@.@@\r\n@@@@@@@@@@@@@.@@@@@@@..%@@@@@@@@........=........#@@@@@@@.#@\r\n@@@@@@@@@@@@@....@@@@-@@......@@@@@@@@@@@@@@@@@...@#....@=.@\r\n@@@@@@@@@@@@@@@@...@............@@@@@+........@@@..@@@@@@@.@\r\n@@@@@@@@@@@@@@@.@@@..@.........@@@@@@..........@@=.@..@@@@.@\r\n@@@@@@@@@@@@@@.%@@+.@@@@@@@@@@@.....@@@#=......@..@@@.:@@@.@\r\n@@@@@@@@@@@@@@..@@@.-@.....@@@@..@#.+@@@@@@@@@+.@@@@@-=@@..@\r\n@@@@@@@@@@@@@@@@..@@@.@@@@@..@@@@@@@@@#%@@@@@@.-@@@-.+@..-@@\r\n@@@@@@@@@@@@@@@@..%..@@@@@@@:...............*+..=@@....@@@@@\r\n@@@@@@@@@@@@@@@@@...@...@@@@..#=....#@%..@@%..@+....@@#...@@\r\n@@@@@@@@@@@@@@@@.#@@..+@@=.#@+..@@@%:...@#=@@@@@@*@@@@@@@@.@\r\n@@@@@@@@@@@@@@@.@@@@@@*...-@#@...@@...@@@@@@@@@@@%.@%%%%@@.@\r\n@@@@@@@@@@@@@@@..+@@@@@@@.@@@@@@@@@@@@@@@@@@@@@...=@@%%%@..+\r\n@@@@@@@@@@@@@@@@@..+===+#..@@@@..*++#=.@@@@@@@@@@@..-===#+..");
            var inputKey = Console.ReadKey();
            if(inputKey.Key == ConsoleKey.Enter)
            {
                Console.ResetColor();
                Console.Clear();
                return;
            }
            else if (inputKey.Key == ConsoleKey.Escape)
            {
                Console.ResetColor();
                Console.Clear();
                return;
            }
        }
    }
}
